# Назва: «Рятувальна операція: зворотний відлік»
# Умова:
# Ти — програміст у центрі керування польотами. Космічний корабель готується до посадки, і тобі потрібно написати програму для автоматичного скидання швидкості.
# Твоє завдання:
# Створи змінну speed (початкова швидкість), нехай вона дорівнює 10.
# Використовуй цикл, щоб поступово зменшувати швидкість до 0.
# На кожному кроці циклу:
# Виводь на екран поточну швидкість: "Поточна швидкість: [значення]".
# Використовуй розгалуження (if): якщо швидкість стає 5, виведи попередження: "Увага! Вмикаємо гальмівні парашути!".
# Коли швидкість досягне 0, цикл має зупинитися, а програма повинна вивести: "Корабель успішно приземлився!".
# Підказка для розв'язання:
# Тут найкраще підійде цикл while speed > 0:, а всередині нього треба не забути робити декремент (зменшення швидкості на 1), про який ми говорили раніше.


speed = 11

while speed > 1:
    speed -= 1
    print("Поточна швидкість:", speed)
    if speed == 5:
        print("Увага! Вмикаємо гальмівні парашути!")
    if speed == 1:
        print("Корабель успішно приземлився!")